cavityExpwEHD_a/0/neg
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      neg;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 -3 1 0 0 1 0];

internalField   uniform 0;

boundaryField
{
    insulatedWall
    {
        type            zeroGradient;
    }

    electrodeHV
    {
        type            zeroGradient;
    }

    electrodeG
    {
        type            fixedValue;
	value		uniform 0;
    }

    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
