cavityExpwEHD_a/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    default         Gauss linear;
    grad(p)         Gauss linear;
}

divSchemes
{
    default         	none;
    div(phi,U)      	Gauss upwind;
    div(phi,pos) 	Gauss upwind;
    div(phi,neg) 	Gauss upwind;
    div(posFlux,pos) 	Gauss upwind;
    div(negFlux,neg) 	Gauss upwind;
}

laplacianSchemes
{
    default         Gauss linear orthogonal;
    laplacian(phii)  Gauss linear orthogonal;
    laplacian(D,pos)  Gauss linear orthogonal;    
    laplacian(D,neg)  Gauss linear orthogonal; 
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         orthogonal;
}


// ************************************************************************* //
